app/controllers/articles_controller.rb

SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT 1  [["id", 1]]
---
  def show
    @article = Article.find(params[:id])

INSERT INTO "articles" ("title", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "My article title"], ["description", "My article description"], ["created_at", "2019-06-03 23:17:32.503629"], ["updated_at", "2019-06-03 23:17:32.503629"]]
---
  def create
    @article = Article.new
    @article.title = params[:title]
    @article.description = params[:description]
    @article.save

SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def edit
    @article = Article.find_by_id(params[:id])

SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "articles" SET "title" = ?, "description" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["title", nil], ["description", nil], ["updated_at", "2019-06-03 23:17:32.591292"], ["id", 1]]
---
  def update
    @article = Article.find_by_id(params[:id])
    @article.update(title: params[:article][:title], description: params[:article][:description])